{
  "posts": [
    {
      "title": "Glasgow Film Festival 2023",
      "date": "02/04/2023",
      "content": "So I had the wonderful opportunity to work as press at the Glasgow Film Festival. I was so excited to be covering my first film festival, and let’s just say, the weekend absolutely did not disappoint. It actually exceeded my expectations. I already knew that spending three days in a cinema was my idea of a great time, but I had no idea just how strong the programme was for the festival. Out of all films I watched, while some of them may not have been exactly my sort of thing, none of them disappointed. I even managed to expand my horizons and find myself enjoying films I really did not expect to.\n\nMy first film of the festival was my favourite. I really didn’t expect to enjoy it as much as I did, but *L’immensita* told its story in such a beautiful way. The shots and camerawork were just so well suited to the storyline and created this aura of nostalgia throughout. It was a really lovely exploration of childhood wonder and how the world is perceived through the eyes of someone who’s just starting their journey into adulthood and figuring out who they are. While there were no major plot points, it was more of an insight into the complexities of human relationships and the emotions that accompany a trans child's journey. It also did very well at highlighting a common problem for trans youth: parents who love their child but do not understand their needs or how to help them navigate their transition.\n\nNow, as Allison Gardner, the CEO of GFF, said in her intro for the film, Penelope Cruz really does not age. There were so many extreme close-ups of her face, and there was not a single wrinkle. AND if there is anyone to make crying and smoking look so glamorous, it would be Penelope Cruz. It also must be said that a great film is not great until it has not one, but multiple music numbers. *L’immensita* was just so enjoyable to watch, with both sad, melancholic scenes and some subtly very funny moments. If you get the opportunity, don’t miss out on seeing these wonderful performances and this incredibly interesting story.\n\nThe next film on my schedule was *Our Father, The Devil*, a French film exploring themes of trauma, revenge, guilt, and religion through the refugee protagonist, Marie. The film provoked some very interesting questions of morality and second chances: if good people do bad things, does that make them bad people? From a technical standpoint, the camerawork was superb. An example of this is a scene when the Catholic priest that Marie suspects of being the warlord who slaughtered her family years prior enters the kitchen to ask for some more food. The camera stays focused on her while he is seen through the reflection of the oven, almost as if he is a ghost, forcing the viewer to engage with Marie’s psychological journey.\n\n*Our Father, The Devil* seemed to follow a theme that has appeared in quite a few films at the minute: the importance of female friendships and relationships. In the end, it is about a woman reclaiming her power and her body from all the horror she has experienced, and her main pillars of support are two women companions. Having said that, the methods by which she attempts to heal might not be the most morally acceptable, but who am I to tell a traumatized woman how to deal with her potential abuser? By the end of the film, I was emotionally exhausted. Ellie Foumbi did a great job at telling this harrowing story, supported by Babetida Sadjo’s and Souléymane Sy Savané’s performances. I would recommend seeing this film to gain further insight into refugee stories and the trauma that accompanies that, but I don’t think I have the emotional capacity to watch it again anytime soon.\n\nOkay, so we all know I am a big-time horror movie nerd, so *Hunt Her, Kill Her* really should’ve been a bit of me. Unfortunately, from the get-go, I couldn’t really get into it. I felt it took too long to get into the meat of the story, and something about the dialogue felt extremely wooden. On the technical side of things (and I might just be being a pretentious film academic here), but the sound editing was really irritating—it was echoey and had a tinny sound that just distracted me too much. Having said all this, though, what it lacked in dialogue it made up for in some very intense chase scenes through a setting that suited the storyline so well: a dark creepy warehouse with our protagonist working the night shift. That’s classic horror movie vibes right there, and I am here for it.\n\nSomething I absolutely loved about this experience was that it was my first time sitting in a cinema with other horror movie nerds who actively interacted with the film. It was so special to share the understanding of the sheer horror absurdity we were seeing. The kill scenes were hilarious and had the whole cinema cackling at how ridiculous and creative they were. The special effects were great—lots of blood and very realistic-looking injuries accompanied by some lovely squelchy sound effects—and it showed a character actually being injured and how that inhibits their ability throughout the rest of the film, something we rarely see in the slasher genre. However, I found the protagonist extremely irritating, and for me, a slasher is all about the motive. I just felt the killer's motive was not strong enough. I probably won’t be watching it again, but if you love a good kill scene, then go for it.\n\nI am fascinated by history, particularly figures such as Mussolini, and obviously, I love cinema, so I should’ve loved Mark Cousins’ *The March on Rome*. So tell me why I fell asleep. And it wasn’t just me; the two people in front of me slept most of the way through, and the guy behind me snored for about half an hour at one point. I think Mark Cousins just has one of those voices that can put anyone to sleep. So the moments I was awake for narratively felt a little disjointed, and I couldn’t piece together all the puzzle pieces he’d provided.\n\nWhile I think it did a good job of highlighting the horrors of Italian colonization in Africa, I personally had an issue with the amount of images of dead bodies and victims of this colonization. It felt very exploitative, especially as the images were from roughly 100 years ago, meaning these people’s grandchildren and great-grandchildren could still be alive and still suffering from the trauma of these horrors. I just feel there are other ways you can show and bring attention to these horrors without overtly showing close-up images of their dead bodies. Towards the end, he did a good job of comparing fascist propaganda with other films of the time, showing the overall lack of creativity and artistic value of the fascist regime and their inability to embrace new and exciting techniques. Overall, I think it’s a really interesting topic, but it just didn’t grab me as much as it should have. I can totally see what he was trying to do with this film; I just don’t think it’s as effective as he wanted it to be.\n\nMy final film of the weekend was a lovely story centered on family values and relationships. *Something You Said Last Night* was an honest and realistic insight into family dynamics, especially when on holiday. It was so refreshing to see a story with a trans protagonist that isn’t based around trans trauma. The story did not hinge on the fact that Renata, our leading lady, was trans. It was simply a story about her trying to find her independence while also navigating how that interacts with the childlike comfort of her relationship with her family—and she also just happened to be trans. I feel this film is something most people can relate to. While it was essentially just a family on holiday, the interactions Renata had with her mother, father, and sister are all too recognizable. It’s clear this family loves each other, but as families do, they argue, irritate, and antagonize each other.\n\nIt is so interesting to see the emotional arc of Renata throughout the film. What I enjoyed most was the parallel from the opening scene to the closing scene. Both take place at a service station on their way to and from their holiday. The difference in Renata’s attitude towards her family and the overall atmosphere between them all is clear to see and really highlights the emotional journey they have all gone on. I don’t have much else to say on this one other than it’s just a nice and easy-to-watch film. If you’re someone who is starved of queer stories that don’t center on queer trauma, then this would be one of those films where you curl up under a blanket on a lazy Sunday and just enjoy.\n\nI am so sad my time at Glasgow Film Festival 2023 has come to an end. It has been a truly wonderful experience, one that exceeded my already high expectations. I really hope to return next year for the full programme and watch even more wonderful cinematic journeys and adventures. I strongly urge you to go to a local film festival or even make a weekend out of it and travel further afield. This weekend has urged me to step out of my comfort zone and embrace different styles and genres, and I have just had the best time. Hope to see you all at Glasgow Film Festival 2024."
    },
    {
      "title": "Eating the Screen Review",
      "date": "23/09/2023",
      "content": "An innovative and exciting idea, Eating the Screen introduces the reader to the world of food on film and provides multiple perspectives and avenues through which to explore the topic. Who knew food had such an imperative role in storytelling?! The Chef’s Note at the beginning of the menu style anthology provides an insightful introduction into the use of food in film and how each collection of reviews in their ‘starter’ ‘mains’ and ‘dessert’ sections approach the several ways in which food and consumption are presented and utilised on the big screen. Jumping right into the thick of it I skipped most of the starters and headed straight for the ‘meatier’ options and sunk my teeth right into the mains (I will not stop with the food puns). Shelby Cooke’s essay ‘Feasting on Females’ had me by the throat right from the title. Having loved Mimi Cave’s debut feature film Fresh (2022) and being the raging feminist that I am, there was no way I wasn’t going to devour this review in its entirety. Cooke presents a really interesting and unique perspective on the representation of the male gaze right from the offset. Being a film student, I am constantly discussing the female object being consumed by male audiences…but not the actual physical consumption of female bodies. It’s a fascinating discussion on Mimi Cave’s use of camera angles and specific shots to convey this metaphor that Cooke presents in an eloquent and easily accessible manner. Basically, it’s not filled with a bunch of unnecessarily long words that make it impossible to understand. Delving further into her exploration, Cooke explores how the film depicts the issue of women’s contribution to the ingesting of the female form and highlights some really important details I actually missed during my first watch. She discusses the main villains and their role not just in the film but how this translates into our society, with a prime example being the wife of Steve, the main villain of the film. Cooke wonderfully explains how the audience is led to believe she is another victim of this cruel system, however the climax reveals her to be acting on her own volition and for her own personal gain. This is a really interesting metaphor to explore the role of the female in the continued application of the male gaze and other patriarchal structures in place within film. The final line of the review reminds the reader what is actually so terrifying about this film, that it reflects the real-life horrors of the patriarchy. Cooke’s analysis is a clever and succinct exploration of how Cave has subverted the male gaze to ‘make us hyper-aware of how our eyes look at others’ and she explores the tactics and metaphors Cave has presented in a clear and concise manner. Cooke practically serves us the metaphor meanings on a plate in an easily digestible and understandable manner. With this essay being my introduction to the menu, I couldn’t stop myself from gobbling up the rest of them. I had no idea there was so many interesting and unique avenues through which you could analyse the use and presentation of food in cinema, and here I am expanding my palate and taste testing every single one."
    },
    {
      "title": "Daniel Sloss Dark review",
      "date": "12/10/2023",
      "content": "To be perfectly honest with you, I would be lying if I said this was my first time watching Dark…or if it was my fourth… if ever I am at a loss for what to watch, Dark is usually a favourite go to of mine. It absolutely never gets old. While, admittedly, the first viewing experience can be shocking, Sloss’ delivery is so fearlessly honest and unashamedly genuine that one is able to quickly look past the shock factor and enjoy the experience. He establishes somewhat of an unspoken trust with the viewer from the get-go and even reminds us half way through that he would ‘never lie to (us)’. Accompany this with an absolutely fascinating way of interacting with the audience as a whole, as opposed to singling out individuals, and you’ve got yourself one unmissable comedy set. Addressing the audience as one being, including those sat at home watching on Netflix, and being able to do so effectively, is a rare quality in a comedian and yet Sloss makes it seem effortless.  His approach to performing jokes relies heavily on his ability to walk the fine line between obnoxiously narcissistic, yet totally self-aware, and aggressively self-deprecating. His mannerisms and gesticulation combined with this gripping stage presence make it very clear that no other comedian could evoke these reactions with the same material. The continuous vulnerability he shows in sharing his experiences while exploring the comedic aspects of these supposedly ‘darker’ topics is ground-breaking. He has completely redefined the term ‘dark humour’ as we currently know it, with jokes centring on his own trauma and none at the expense of other people’s. His recounting of the death of his sister is a truly remarkable piece of comedy. In all honesty, who else could have a whole room of people laughing so soon after saying the phrase ‘and that’s when my mother told me my sister had died’. Sharing anecdotes of his sister’s life using the present tense to describe them almost allows for the audience to feel this false sense of security and in doing so assuring them that it is ok to laugh. To then shatter that using one sentence, bringing the entire room to a halt, created a certain level of fear within the viewer for laughing along to jokes about his dead sister. This was soon to disappear as he somewhat aggressively reassures the audience as to why it is acceptable to find his jokes funny, once again filling the room with laughter. It is at this point while watching the set that I remembered the live audience is American, which personally I found added to the hilarity of the set. While American dark humour can be dark, it does not compare to Scottish dark humour, and I feel Daniel Sloss really threw them in the deep end with this one. Mixing his dead sister jokes with his very vocal negative attitude towards religion, especially in America, was a risky game he played and yet it seemed to pay off. With Sloss delivering exactly what it says on the tin, Dark is a beautifully funny and yet tragic set that is both cleverly written and expertly performed. I can confirm that I will probably watch it again at least another four times this year.  "
    },
    {
      "title": "Candyman (2021) Review",
      "date": "13/11/2023",
      "content": "I have never seen the first Candyman, so I went into this with absolutely zero expectations. I’m an absolute lover of horror films, slashers in particularly, so naturally I was looking forward to it. With Jordan Peele already establishing himself as an incredible screenwriter (and director), this film has a lot to live up to, and it’s safe to say that is evident here. To begin with, I was really convinced prime had a bug or something, because all of the opening credits are backwards. Eventually I made the connection of the relevance of mirrors to the storyline and overall themes of the film. Classic Peele giving us some thought-provoking imagery, right off the bat. This really set the tone for the rest of the film. I think the intention was to cause slight discomfort in the viewer and immediately I felt jarred. The first scene genuinely sent a chill up my spine. It wasn’t a usual jump scare you would expect, it was gradual and unnerving. While this feeling did not linger for long, as this is followed by a narrative set up that of course highlights the major themes of current socio-political issues the film will be discussing, in this case systemic racism.  The fear and discomfort prompted by the beginning scene had shifted to something a lot more insidious that is a terrifying reality for a lot of human beings. As is the case with most of the work Jordan Peele has been involved with or created, a running theme of the film is black people’s, particularly black men’s, relationship with society both currently, and throughout history. He has an amazing ability to evoke important discussions, and present eye-opening sequences that are, simply put, scary. He really has created a whole new level of elevated horror, that highlights very real fears for members of our society, which is more terrifying than any boogeyman. Is it obvious I’m a little bit of a Jordan Peele stan? I will say this film does need to be paid attention to, it’s not something you can stick on while you are making dinner or something. It needs focus and deserves every moment. While I really did enjoy watching Candyman, I do think a Jordan Peele film is best directed by him also. Don’t get me wrong, Nia DaCosta did a great job, I just feel some of the narrative would have been better communicated had it been Peele directing. Nonetheless, the film really brings a new lens to the genre and also has all the gore you would want and expect from a slasher. Just maybe don’t eat your dinner while watching, some bits really made me cringe. There are some places on the human body where a massive hook is really not ideal. So, I’d say absolutely have a watch if you’re a slasher enthusiast or not. It’s a great example of very intelligent and important filmmaking, and I think really has the ability to appeal to a wider audience. I’m now going to watch the original Candyman (and maybe the other 2 in the series as well) and see how the two compare. Hope everyone is enjoying the spooky season!"
    },
    {
      "title": "Belfast Film Festival 2023 - My Experience",
      "date": "18/11/2023",
      "content": "Two years and two months ago, I moved to Belfast to expand on my love of film by studying the subject in the city that is currently booming in the industry after revelling in the success of the Game of Thrones series. And in all honesty, I am so blessed to call this vibrant, exciting, and culturally complex city my new home. I knew the Belfast Film Festival 2023 was not to be missed and was worth writing about, so I got stuck in. Hope you find something worth it in the following, and if you get the chance to come to Belfast, then absolutely say yes."
    },
    {
      "title": "How to Have Sex (Belfast Film Festival 2023)",
      "date": "18/11/2023",
      "content": "My first film of the festival was filled with nothing but nostalgia for me. Going in, I knew it was going to discuss some pretty hard to swallow truths about virginity and teenage sex, set to the wild backdrop of the Malia strip, but I had no idea just how on the money this film was. From the ripped paper wristbands and the cigarette-induced vocal fry, to the constant background bump of bass, this film did not miss a detail. Molly Manning-Walker encapsulated every moment of a 17-year-old gal's trip to Malia. It’s your first real moment of freedom. You can stay up all night and go skinny dipping in the sea while the sunrise with your best friends who you truly believe are your soul mates.\n\nIn the first scene, Manning-Walker captured that unconditional, fierce love that teenage girls have for one another, a love that you feel will always last forever no matter what. It’s that beautiful naivety that all good things must last, something you almost wish we could bring with us into adulthood. So many moments in this film mirrored almost exactly my own experience when I was 17 in Malia, it got to the point that I am actually convinced I wrote this. I’d even taken the same flight path they did!\n\nI’d heard beforehand that it was a hard watch, and that is true. It’s an incredibly hard watch especially for those who can remember this time of our lives and can remember sweaty nights like this that leave sour tastes in their mouths. All of Tara’s, our leading lady, relationships and interactions with others are so nuanced and true to real life, and Mia McKenna-Bruce’s performance is outstanding. She takes you along on Tara’s emotional journey throughout and does so in a magnificent way.\n\nI will tell everyone to go and see this film. It brilliantly explores these pertinent issues and does so in a way that un-blurs those supposed ‘blurred lines’ when it comes to consent. It’s uncomfortable, and heartbreaking, and hilarious, and true. It will make you want to go back to being a teenager who could take on the world, while simultaneously reminding you why you’re so happy those years are behind you."
    },
    {
      "title": "Double Blind (Belfast Film Festival 2023)",
      "date": "18/11/2023",
      "content": "In contrast, I was not super impressed with Double Blind. There was a clear shared love of 80’s horror films between myself and the filmmaker, and that was amplified massively through the soundtrack. But other than that, I couldn’t get into it like I usually can with 80’s horror. Don’t get me wrong, the camera work was great. I loved the use of classic match cuts, almost like an homage to infamous horror directors such as Stanley Kubrick, and the imagery itself was very pleasing to the eye.\n\nThe Director of Photography did a brilliant job of making the audience feel claustrophobic and frantic at times, with the use of varying angles and movements throughout shots. Within the first half an hour though, I knew there was something I didn’t like about it. Something felt off. I couldn’t decide if it was the writing that I felt was stiff, or the acting, but something wasn’t working for me. The dialogue felt stunted at times.\n\nThere are some really tense and jumpy moments, but they don’t feel scary, they just take you by surprise, and there is a lot to be said for the work the soundtrack does in creating these tense moments. As it moved along, the performances and the storyline got better. I really liked the aspect of using the decaying of the human psyche as a horror narrative tool. There is nothing scarier to me than your brain turning against you. But the dialogue just didn’t work for me."
    },
    {
      "title": "Communion (Belfast Film Festival 2023)",
      "date": "18/11/2023",
      "content": "Communion was something different for me. A half an hour insight into religion in rural communities in Northern Ireland. Who knew that a story surrounding a small parish closing down in the middle of nowhere could be so devastatingly beautiful?\n\nAs someone who was not brought up religious, I didn’t think I would connect much to the story. I find myself unable to understand what religion can mean for people sometimes. Communion did a wonderful job of showcasing the sadness and melancholy the priests are feeling as they grieve their closing parish, contrasted with the wild and vibrant Ulster countryside.\n\nThe film highlighted some very real reasons that people have lost faith in the Catholic church, while also encapsulating the importance of the comfort the parish provides to this small community. Even if you’re not religious, the imagery alone is worth it and it’s just an overall nice watch."
    },
    {
      "title": "Heaven Scent (Belfast Film Festival 2023)",
      "date": "18/11/2023",
      "content": "Ok, this one was an interesting one. Did you know Presbyterian is an anagram for Britney Spears? Me either. With absolutely zero funding, and that was very clear, I had very low expectations going in. And let me tell you, this was the most fun I have ever had in a cinema.\n\nNow, using scratch and sniff in a film is a risky game, but I respect the risk. At the end of the day, films are a version of storytelling, and you can always enhance that experience by introducing the use of other senses. The issue is that it doesn’t always work. I’d love to say it worked this time… but… 8 out of the 10 smells all smelt the same. But it didn’t take away from the film at all.\n\nHeaven Scent felt homegrown, and the audience felt familiar…almost like family. It was hilarious. Everything about it was so sincere. I have met all of these characters in real life. I left the cinema on a high—the sense of community evoked by that film had me feeling elated."
    },
    {
      "title": "Goodbye Julia (Belfast Film Festival 2023)",
      "date": "18/11/2023",
      "content": "I loved this film. I loved it. Set in Sudan just before they voted to separate the south and north into two different states, Goodbye Julia tells the story of female friendship and empowerment in times of conflict and oppression. It’s a typical Romeo and Juliet story, but with platonic feminine love.\n\nIt was heartbreaking from the get-go. Not in a brutal and graphic manner, but in a way that forces you to reflect on the varying devastations of war. There is some absolutely brilliant imagery that focuses on the similarities between both of our leading ladies. They’re both human experiencing human feelings and situations regardless of which community they were born into.\n\nEven if you aren’t usually one for international films, it is so worth a watch. It was very well received by the Sudanese population in the cinema with me, and it translates well to a western audience."
    },
    {
      "title": "Fréamhacha (Belfast Film Festival 2023)",
      "date": "18/11/2023",
      "content": "My closing event with the Belfast Film Festival was a ‘Work in Progress event’ for a new Irish language horror film hoping to be debuted next year. For just over an hour, the audience was privy to a panel of the filmmaker and her leading actresses, as well as four exclusive clips from the film itself. Obviously, as the film has not been released yet, we were asked not to share details, but from what I’ve seen this is going to be one to watch.\n\nThe Irish language has suffered years of attempted erasure, so to begin with, it’s nice to see feature-length films being made solely in Irish. Personally, I feel the Irish language and culture lends itself perfectly to horror, as director Aislinn Clarke said, ‘it’s hard to get away from religious influence of Catholicism and folklore’ especially when doing an Irish language horror set in Ireland.\n\nIt was just a really interesting insight into the creative process as a whole, as well as an interesting discussion between women about their experiences while shooting and creating this film. I am really looking forward to seeing it."
    },
    {
      "title": "Conclusion of Belfast Film Festival 2023",
      "date": "18/11/2023",
      "content": "As always, the festival was a wonderful showcase of both local and international filmmaking talent, with a massive and varied program. Thank you so much Belfast Film Festival 2023 for the wonderful opportunity to attend and write about my brilliant time with you. I already can’t wait for next year. As I said earlier, if you have the chance to visit Belfast, then do, but if you have a chance to go to the film festival, you’d be silly to say no!"
    },
    {
      "title": "Interview with Joelle Farrow: Behind the Scenes of a Rising Star",
      "date": "02/12/2023",
      "content": "I had the absolute pleasure of sitting down with Joelle Farrow, an up-and-coming actress and filmmaker whose passion for storytelling is infectious. We dove deep into her journey through the world of acting, her transition into filmmaking, and the powerful stories she is committed to telling.\n\n**The Early Days**\n\nJoelle’s journey started, as many do, with a love for performing at a young age. 'I’ve always known I wanted to be in front of the camera,' she says with a smile, recounting her childhood filled with home movies and school plays. 'But it was more than just acting for me—I wanted to understand every aspect of how a film was made.' This curiosity eventually led her to explore filmmaking in greater depth, moving from a budding actress to someone with a clear vision both in front of and behind the camera.\n\n**Finding Her Voice**\n\nOver the years, Joelle has taken on various roles in both television and film, but it wasn’t until she stepped into the world of filmmaking that she truly found her voice. 'Filmmaking allowed me to take control of the stories I wanted to tell,' she explains. 'It’s empowering to move from interpreting someone else’s vision to crafting your own.' Joelle’s work often touches on themes of identity, mental health, and female empowerment, with an authentic and raw approach that resonates with audiences.\n\n**Challenges in the Industry**\n\nOf course, no journey in the entertainment industry is without its challenges. Joelle opens up about the difficulties of balancing acting and filmmaking, particularly in an industry that often puts women in specific boxes. 'It’s tough,' she admits. 'There’s always pressure to conform to certain roles or expectations, especially as a woman in this field. But that’s exactly why I want to be part of the change.' Joelle’s commitment to telling diverse and meaningful stories is clear, and she’s determined to pave her own way, breaking barriers along the path.\n\n**Looking Ahead**\n\nAs we wrap up our conversation, Joelle gives me a glimpse into what’s next. 'I’m really excited about the projects I have lined up,' she says. 'There’s a lot in the works, both acting and directing. I want to continue pushing myself and exploring new ways to tell stories that matter.' With her passion, talent, and drive, there’s no doubt that Joelle Farrow is a name we’ll be hearing much more of in the future.\n\nKeep an eye on this rising star—her journey is just beginning, and we’re all lucky enough to be along for the ride."
   },
   {
    "title": "Hocus Pocus 2 Review: A Nostalgia Missed Opportunity",
    "date": "10/12/2023",
    "content": "I woke up this morning and all of a sudden, it is autumn. Leaves are orange, pumpkin spice is everywhere, and *Hocus Pocus* is back on our screens. As my housemate yelled ‘IT’S SPOOKY SEASON!’ in my face, the Halloween excitement riled up inside of me, and I thought *Hocus Pocus 2* was really going to scratch that All Hallows' Eve itch. It did not.\n\n*Hocus Pocus 2* didn’t hit the nostalgia button like I thought it would. It just didn’t have the same feeling the first one did. The first *Hocus Pocus* was like a horror film for kids, and I’ve a feeling it’s where my obsession with horror movies began, so it clearly holds a special place in my heart. From the moment I pressed play on the second one, I was just underwhelmed. To give it some credit, I don’t think its intended target audience is 26-year-old me. To a child nowadays, it might be just as magical as the first one was for me. But let’s be honest—they should have made *Hocus Pocus 2* with people my age in mind. We grew up with the first one and have waited our entire lives for this, and it just fell a little flat for me.\n\nThere were some positive attributes to reintroducing such a classic to the screens of the 21st century, like the empowering feminist messages explored throughout. There was a strong emphasis on the importance of sisterhood, friendship, and supporting other women rather than tearing each other down—crucial lessons for the younger generation. The film contained multiple strong female roles, who were not overshadowed by their male counterparts. It’s refreshing to see major female characters taking the spotlight, while the men serve as supporting characters, not the heroes. It also explores teenage relationships and how to navigate adolescence, which are relatable and important themes. So all in all, it teaches great lessons to the younger generation instead of what we got in the 90s, which was much less empowering and a little more patriarchy-fueled. The approach to the modern world was endearing, and while the nostalgia wasn’t fully there, it did bring something new to the table.\n\nHowever, the musical numbers didn’t leave the same lasting impression as the iconic ‘I Put a Spell on You’ sequence from the first one. They were okay but nowhere near as memorable, and the writing felt wooden—perhaps because it was written for a much younger audience. While it may not have been the sequel I was hoping for, the underlying themes that are relevant to today’s world make *Hocus Pocus 2* an appropriate film for the upcoming generation, and it made me thankful for the film we were gifted in the 90s. It was fun, but for me, it just felt like something was missing—probably the 90s nostalgia. I might watch it again in the run-up to Halloween, but I think I might just stick with the first one."
  },
  {
    "title": "Film East",
    "date": "10/01/2024",
    "content": "Film East’s previous anthology must have really stirred up an appetite (wink, wink, nudge, nudge) in me because the moment I was presented with the opportunity to review their current one, I could not send that email fast enough. *Eating the Screen* was an absolutely delicious exploration into film that I hadn’t realized I was desperately hungering for until I read it, so of course I am ready to devour this year’s anthology, which combines my two favorite things – queer theory and film theory!\n\nTo begin with, the differing lenses and aspects offered up in each article mean that, as a reader, you are truly spoiled for choice. Some essays explore already established queer film theory in their own manner, while others provide a completely new angle that one may not have considered before. Despite their variability, each essay provides a unique, detailed, and well-thought-out analysis that opens your eyes and really puts representation in film into perspective.\n\nOne standout article (what with me being what one may call a Swiftie) was ‘“ME!” By Gaylor Swift: Queer Iconography in Taylor Swift’s Music Videos,’ written by Film East editor Shelby Cooke. I thoroughly enjoyed reading Shelby’s essays in *Eating the Screen*, and she continued to entertain and educate me while taking me on a journey through the gay ‘semiotics’ in the Taylor-Verse. The piece was well-informed in both Swift lore and the academics of semiotics and artistic nuance, introducing me to the idea of separating the art from the artist, particularly when it comes to pop stars. I hadn’t considered perceiving *Taylor Swift* as distinct from the persona Taylor Swift, the character she portrays. It was captivating throughout.\n\nA slightly more conventional discussion of queer representation is proposed in Jessica Ann Evangelista’s ‘*Stranger [Things] than Fiction: Queer Characters as Devices for Heterosexuality*’. She tackles classic issues with queer representation that remain relevant in mainstream media. While we may celebrate the normalization of openly queer characters on our screens, it doesn't truly count if they aren’t given the same attention as their heterosexual counterparts. Jessica Ann reminds us that queer people shouldn’t have to settle for mediocre representation. Queer people deserve to see (and be seen as) successful, complex, and loved—even if they are side characters. It’s a powerful reminder that the bare minimum in representation is still not enough.\n\nOther interesting reads worth a go include Rebecca Grenham’s essay on *The Older Queer Woman: Subverting Female Queerness in Modern TV*, an eye-opening discussion on how aging queer women explore their lost youths in various ways. *Holmgang and Homoeroticism: Sexuality in Robert Eggers’ The Northman* by Billy White is also an enjoyable read, delving into the hidden homoeroticism and feminist themes woven throughout the film.\n\nFilm East once again presents a varied and well-curated anthology on the multitude of aspects to consider in the conversation surrounding queer representation, and I will absolutely be reading the next anthology cover to cover. I am yet to be disappointed."
  },
  {
    "title": "Mean Girls: The Musical Review",
    "date": "15/02/2024",
    "content": "I do not like musicals. Never have. Never will. But I do love the classic piece of cinema that is Mean Girls (2004), so I thought surely, I would at least enjoy some of the Mean Girls musical. I aggressively disliked it.\n\nI spent a good portion of the film convincing myself it had been on for ages, and it would be over soon, to then look at my watch and realize it was only 40 minutes in, and I still had an hour and 10 to go. It was almost excruciatingly boring.\n\nAt first, I thought I didn’t like it because it was a musical, but upon further inspection, it was just lacking the charm that the original is so loved for. I understand the reasoning behind wanting to make the film, but I don’t understand why you would want to compete with something that’s already so iconic. When you already have a well-established film, that then became a very popular musical, why would you want to try and out-do them both? This film was really just set up to fail from the very beginning. I really wish we would get past this trend of remakes; they are always a disappointment, and are you really going to tell me that there isn’t one singular original thought in the entire Hollywood film industry?\n\nThere are some differentiating factors, but some of the jokes really just don’t land when you put a ‘Gen Z’ lens on it. While the original film has its problems, it is quite a true representation of its time. People do call women sluts and whores, so why do we now have to omit all that language from films, when we can use it as a way to address these issues? However, it is quite pleasant not seeing rampant homophobia on the screen.\n\nNow, having said all this, there were a few things I liked a little bit. This is a controversial opinion to have but I actually liked the film version of the song ‘Stupid with Love’. It has been stuck in my head since I saw the film, but it is just quite a cute song. And of course, I am never going to be disappointed seeing Lindsey Lohan in movies again. But the best part of the whole film, and the only reason I would even watch a snippet ever again, is Renee Rapp. I don’t mean to objectify her, but she is so hot in this film. She is a perfect Regina, and I really enjoyed every moment she was on the screen. The woman is a treasure, and I am so excited to see where the rest of her career takes her.\n\nI will definitely not be watching this film ever again, if I can help it, with the exception of the clips of Renee Rapp that come up on my TikTok for you page. Even big fans of the musical have shown their dislike for it, and I rarely am in agreement with fans of musicals. I’m just going to keep watching the original, and try to forget that this version exists."
  },
  {
    "title": "Love Actually: A Christmas Review",
    "date": "20/02/2024",
    "content": "I think we can all agree that Love Actually has one of the greatest Christmas film openings of all time. Even with Hugh Grant as the voiceover. To be honest, it lives in my head rent free, especially when I am at the airport. I get so emotional watching people reunite with their loved ones at the arrivals gate, and I blame this film for that.\n\nIt’s a shame the rest of the film doesn’t quite live up to it. The exception to this is the final scene back at Heathrow, but the in-between is irritating and mildly offensive. To start with, I used to really love Natalie, the absolutely NOT FAT prime minister’s assistant. I thought she was funny and charming, and to an extent I still agree; however, I have since realized that she is mostly reduced to a stereotype who’s only notable element is her weight or her sex appeal. They even try to address why this is wrong in the film, but then continue to not really develop her character’s personality further than making her the point of Hugh Grant’s character arc. Oh, he is so brave for looking past her family background and society's thoughts on her non-existent weight problems. It’s kind of disappointing revisiting this storyline that you once thought was romantic, to discover that it is actually quite superficial.\n\nThere are multiple other issues of representation – the depictions of mental health issues are just sad to watch. Sarah’s brother Michael is granted very limited screen time, even though he is an important part of Sarah’s storyline, and in the few moments we do see him, he is not granted much substance other than being depicted as aggressive. Once again, a disappointing representation that can be, and is, quite harmful.\n\nDon’t even get me started on the fact that it’s a film about several ‘diverse’ love stories, and not one of them is centred on a queer couple. It’s insinuated that Bill Nighy and his manager end on a romantic note, but I feel like it is never overtly stated or addressed. It could just be a lovely story about platonic love. If you are going to have queer characters in your stories then make them queer. Don’t make them womanizers throughout the whole film and then end on an ambiguous note. A small saving grace is Bill Nighy’s comedic delivery; it really is brilliant.\n\nThere are a few other notable elements: Emma Thompson’s performance throughout is an obvious shining light. I will never forgive Alan Rickman for doing that to her, but I have to thank the film for introducing me to Joni Mitchell. A few of the storylines are sweet if you overlook some of the annoyances in them, like how are Colin Firth and Aurelia in love when they cannot understand each other, but ok. Kiera Knightly’s storyline is nothing but creepy, though; there is nothing sweet about stalking.\n\nOverall, I think it is pretty dated. I guess British society wasn’t as self-aware of its role in these issues as it may be now. We have moved on in terms of representation, and while it’s not perfect, it’s a development. I like my Christmas films to bring me joy, and rewatching this just made me feel angry more than anything else. I think I am happy to leave this one behind."
  },
  {
    "title": "Interview with Marie Alice Wolfszahn",
    "date": "27/06/2024",
    "content": "First of all, I have never interviewed a filmmaker before. I’d encountered many during my degree but never formally interviewed, so to be formally interviewing a filmmaker whose feature film is featured in the programme for the Glasgow Film Festival… I was so incredibly nervous. Marie Alice very quickly put me at ease. She was so nice and easy to talk to and provided some really interesting conversation topics and answers to any questions I had. As my niche is horror films, I really tried to focus on the horror aspects of her catalogue, specifically her latest feature *Mother Superior*.\n\nMarie Alice began by explaining her previous experience in documentaries and how that influences her current work, which really shines through in the historical aspects of *Mother Superior* and adds a certain authenticity to the storyline, and a lot more of a sinister feeling. She discussed with me her interest in imagination within the genre and how the human imagination is a powerful creative tool that can be used, especially in horror, to create these terrifying images. This is another aspect that is very evident in *Mother Superior*, and I expressed to her how interesting and wonderful a lot of the imagery is.\n\nI was particularly interested to know what had inspired her images here, and she informed me that she finds symbolism a key tool in expressing relevant details to the storyline. She went on to state that ‘the 60s and 70s… somehow this era, the colour, the framing, that’s kind of a little more my visual style’ and how it doesn’t seem to be an intentional thing; she just happens to shoot that way and produces a final product that fits seemingly well into that sort of era.\n\nI wondered if *Mother Superior* was always set in 1975 or whether that was something that occurred during development. She had a very interesting point to make about period films, stating through laughs that she is ‘definitely drawn to period films…it’s beautiful, and sometimes it’s a little bit easier to create a world that is familiar but not ours, so I think period films kind of do that.’ This is an important plot device in every genre that she has pointed out here; however, I think it works especially well in horror films to have that mixture of familiarity and unfamiliarity that contributes to the jarring feeling the filmmaker is usually trying to instill in the viewer.\n\nShe further explained how she ‘thinks it’s really boring to write films where there are mobile phones and computers around’ and said it was sort of ‘unsexy’ to see all these devices on screen. I completely agreed with her. Sometimes technology absolutely has its space in cinema, but there is something even more terrifying about the lack of that form of communication that creates a different feeling for the viewer. She rounded off her point by stating how she had a big interest in this particular part of Nazi history and worked mathematically from the 1940s based on how old her protagonist would be, which landed her in the 70s.\n\nShe explained to me how the overall message of the film was that ‘it’s kind of about how sometimes very appealing ideas that we consider as right and something we support and fight for, can potentially walk hand in hand with something appalling… something shocking.’ Everything clicked into place for me then, and she further went on to claim herself as a feminist, stating that she was not intending to attack anyone but merely highlight this possibility. I thought it was a very interesting and original comment, as people can be easily led and not always with the best intentions.\n\nI finished the interview by asking her the all-important question of how she finds it being a woman working in the film industry, particularly in relation to the horror genre. She was so honest and gave a really candid response, saying how she ‘just wants to be funded or supported because of the quality of the script.’ Marie Alice went on to say, ‘with all this gender stuff, I get it; we need to talk about it because unfortunately there wasn’t enough talking about it for a long time. I just wish we had already reached this point where it doesn’t matter.’ This is a statement I’m sure most women in the industry can agree with, where they just want to be supported for their art, and not just to tick a diversity and inclusivity quota.\n\nMarie Alice was so lovely to chat to and was a really great first interview for me. If you get a chance, give *Mother Superior* a watch for some really interesting imagery and a storyline to match."
  },
  {
    "title": "Glasgow Film Festival 2024: My Experience",
    "date": "25/09/2024",
    "content": "After the absolutely brilliant time I had at Glasgow Film Festival last year, in the approach to GFF 24 I was sceptical it was going to live up to the precedent – sufficed to say my time at the festival this year made last time look boring! I spent the 5 days I was in Glasgow running between cinemas, interviews, and various evening events associated with the festival. Movie karaoke was definitely a highlight. The programme this year provided a range of genres and something for everyone to really sink their teeth into, so without further ado let’s get into it.\n\nQuick disclaimer: there are a fair few films I saw that included interviews with the cast and crew which I will talk about in a separate piece, so keep your eyes peeled on the page for those!\n\n**Radical**\n\nFirst of all, this film destroyed me. It was marketed to me as a comedy, so tell me why I spent the last 20 minutes of it in hysterical tears? Based in a small town in Mexico, where the cartel and corruption rule the roost, it follows the story of a teacher striving to engage his students in plenty of weird and wonderful ways. It was a fun and beautiful take on the importance of education, and how typically traditional educational routes are not how everyone learns. It’s a reminder that learning should be enjoyable and exciting, and is a privilege not everyone has access to. The audience is brought on a journey with this class of pre-adolescents exploring all the ways in which they can learn. There were countless moments of pure childlike joy and wonder, contrasted to a backdrop of real terrifying adult issues that no child should have to experience.\n\nThe film highlighted a lot of situations we in the West usually do not consider. I was heartbroken when a girl no older than 11 told her mother she planned to be a teacher or professor one day, and her mother responded by telling her she would not be returning to school this year. The devastation in that child’s eyes was enough to make you want to pay for her schooling yourself. I want so badly for that girl and every other like her in the world to go to school and become whatever it is they aspire to be. This film really made me understand how easy it can be to forget your own privilege, especially as a white English woman.\n\nFor the majority of the first half of the film, I was cackling out loud, and then there was one point I stopped. And then I started crying. And did not stop until the credits rolled. They were a mixture of tears of devastation, joy, hope, and sadness. So many emotions were evoked throughout this story, and in my eyes that’s the sign of a job well done. A film that makes you feel things and opens your eyes to multiple facets of society you were previously unaware of. Brilliant job! At the end of the day, I want everyone who ever questions the value of teachers and education (in all subjects including the arts) to watch this film. Hopefully, it will teach you something.\n\n**Brothers**\n\nOn the complete opposite end of the spectrum, I went into *Brothers* ready to be harrowed and ended up laughing a lot more than expected. It was Czech’s official Oscar nominee, and while it wasn’t shortlisted, it absolutely should have been. It follows the story of two brothers whose father had served in the Czech army during World War II and had been kidnapped, tortured, and murdered by the Nazis. The events of the film take place a few years after this, at the beginning of the Cold War, just prior to the Berlin Wall being erected. Based on a true story, *Brothers* tells of the harsh realities of living in the Soviet Union under communist rule and shows 5 young men’s attempt at escape. Having only ever previously watched films on this topic produced by the American film industry, it can be difficult to identify what is fact and what is propaganda. It was refreshing to see it from a Czech perspective, from people who have the experience.\n\nThe director of GFF opened the film by stating that ‘it opens your eyes to an important part of history’ and I completely agree. It also shows the viewers exactly how freedom fighters and government resistance is created. We all know that good old saying ‘one man’s terrorist is another man’s freedom fighter.’ This film has western audiences sympathising and supporting 5 characters that have been labelled terrorists by their government. It provokes a fascinating conversation on what terrorism actually is and how governments tend to be the cause of terror groups gaining members…but maybe that’s a conversation for a different day.\n\nThe contrast of the beautiful Czech countryside amidst these preparations for violence is a harsh reality of war. These teenage boys should be spending their summer days playing with their friends in the sun, not teaching each other hand-to-hand combat and plotting how to steal guns from the local police.\n\nIt was a lot funnier than I thought it would be and didn’t disturb me as much as I had prepared for. That’s not to say there weren’t some upsetting moments, but overall, it’s a brilliant story that I’m surprised is not as well-known as it should be. The journey these boys go on and what they achieve is absolutely insane. I tend to not be a fan of bloody and horrific war films, but *Brothers* was easier on the blood and violence and focused more on the journey and the message. The film's overall message seemed to be that a life without freedom is not a life; it is survival, and this is a message relevant to so many other instances in our society. I would recommend this film to most, even if you don’t think it’s your cup of tea, it’s an important watch.\n\n**Sleep**\n\nIt’s ironic that this film is called *Sleep* because I fell asleep about 20 minutes in. Considering this is a horror film and we all know I absolutely love horror, I was really unimpressed with this one. Especially as it was a South Korean film, and usually the South Koreans know how to do a horror. There were a few moments that were a bit jarring and created a tension in the air, but it wasn’t necessarily scary. The film follows a newly married couple whose relationship soon hits the rocks when our protagonist begins to sleepwalk and cause some questionable and mildly disturbing happenings. This obviously puts pressure and strain on his wife, who is terrified for her and her newborn baby’s safety.\n\nPersonally, I think the deterioration of one’s mental health is the scariest thing that can happen to a person. Your own brain turning against you and people not taking your fears seriously is something that genuinely terrifies me. There are so many ways a filmmaker can play on these fears and make a good realistic horror, so the potential for this film to be great was there. Don’t get me wrong, the storytelling and stylistic elements were well done, but as a horror, it just doesn’t work. It was very tense, just not scary, and way too slow for me. Hence why I fell asleep.\n\nWaking up two-thirds of the way through caused quite a bit of confusion for me. I was still not really sure what was happening or who was in the wrong. At the end of the film, my final diagnosis was… it was ok. I feel like there is only one scene that classifies as horror, with the rest being mildly tense. I can totally see what the filmmaker was trying to do here, but it just didn’t work for me. The pacing didn’t hit the mark. I’m probably never going to watch it again, unless I’m having trouble sleeping.\n\n**Sorcery**\n\nSorcery was a film I expected to like for one set of reasons and ended up liking for completely different ones. I, myself, am a Celtic Pagan, passed down to me from my mother, which was passed down to her from her mother, and so on. My mother always tells me we come from a long line of witches, and because of this, I have always felt a strong connection to historical stories involving witches. As most of these stories involve some sort of collective punishment for those accused of witchcraft, I often find my interest lies in understanding the fear and persecution experienced by my ancestors and others throughout history.\n\n*Sorcery* flipped the perspective for me. It opened my eyes to a whole new genre of spiritual practice. The film follows Rosa, an adolescent indigenous girl in late 19th century Chile, working as a maid for a German settler family who have also recently converted her to Catholicism. Without giving too much away, the settlers show themselves to be the main evil of the film pretty early on, allowing the viewer to reject settler culture and embrace indigenous. There was a lot of resistance to colonial oppressions through ancient traditions and rituals that could be viewed as modern-day witchcraft, and I loved it. Most of the stories we know about witches are of the white women of Salem in the 1600s, so it was refreshing to be reminded of how prevalent ‘witchcraft’ is in most indigenous cultures.\n\nThis film has a unique way of flipping the narrative from the use of accusations of witchcraft as a tool of oppression, to using it as a form of resistance to that very same oppression. You were never sure throughout if it was actually magic causing these happenings, or just coincidence. Either way, *Sorcery* will have western audiences rooting for a group of indigenous witches against colonialist oppression… brilliant. All the while you are watching Rosa reconnect with her own culture, and in doing so, connect with the land she is native to."
  }  
  ]
}